"""
4.从字符串中提取出所有的电话号码
    string = 电话号码: 028 11111111
    电话号码: 028 22222222
    电话号码: 028 33333333
    电话号码: 028 44444444
    电话号码: 028 55555555
    电话号码: 028 66666666
    电话号码: 028 77777777
    电话号码: 028 88888888
"""
# 导入正在表达式处理模块re
import re
# 定义字符串
string = """
    电话号码: 028 11111111
    电话号码: 028 22222222
    电话号码: 028 33333333
    电话号码: 028 44444444
    电话号码: 028 55555555
    电话号码: 028 66666666
    电话号码: 028 77777777
    电话号码: 028 88888888
"""
# 用正则表达式匹配所有的电话号码
ls = re.findall("\d+ \d+",string)
print(ls)